Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_pwr.h
/*
SPDX-License-Identifier: MIT
SPDX-FileCopyrightText: 2025-2026 Edo. Franzi
*/

/*
; stm32U5Gx_pwr.
; ==============

;------------------------------------------------------------------------
; Author:   Generated using the .svd description    The 2025-01-01
; Modifs:
;
; Project:  uKOS-X
; Goal:     stm32U5Gx_pwr equates.
;
;   (c) 2025-2026, Edo. Franzi
;   --------------------------
;                                              __ ______  _____
;   Edo. Franzi                         __  __/ //_/ __ \/ ___/
;   5-Route de Cheseaux                / / / / ,< / / / /\__ \
;   CH 1400 Cheseaux-Noréaz           / /_/ / /| / /_/ /___/ /
;                                     \__,_/_/ |_\____//____/
;   edo.franzi@ukos.ch
;
;   Description: Lightweight, real-time multitasking operating
;   system for embedded microcontroller and DSP-based systems.
;
;   Permission is hereby granted, free of charge, to any person
;   obtaining a copy of this software and associated documentation
;   files (the "Software"), to deal in the Software without restriction,
;   including without limitation the rights to use, copy, modify,
;   merge, publish, distribute, sublicense, and/or sell copies of the
;   Software, and to permit persons to whom the Software is furnished
;   to do so, subject to the following conditions:
;
;   The above copyright notice and this permission notice shall be
;   included in all copies or substantial portions of the Software.
;
;   THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
;   EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
;   MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND
;   NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS
;   BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN
;   ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
;   CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
;   SOFTWARE.
;
;------------------------------------------------------------------------
*/

#pragma once

#include    <stdint.h>

// PWR address definitions
// -----------------------

typedef struct {
    volatile    uint32_t    CR1;
    volatile    uint32_t    CR2;
    volatile    uint32_t    CR3;
    volatile    uint32_t    VOSR;
    volatile    uint32_t    SVMCR;
    volatile    uint32_t    WUCR1;
    volatile    uint32_t    WUCR2;
    volatile    uint32_t    WUCR3;
    volatile    uint32_t    BDCR1;
    volatile    uint32_t    BDCR2;
    volatile    uint32_t    DBPR;
    volatile    uint32_t    UCPDR;
    volatile    uint32_t    SECCFGR;
    volatile    uint32_t    PRIVCFGR;
    volatile    uint32_t    SR;
    volatile    uint32_t    SVMSR;
    volatile    uint32_t    BDSR;
    volatile    uint32_t    WUSR;
    volatile    uint32_t    WUSCR;
    volatile    uint32_t    APCR;
    volatile    uint32_t    PUCRA;
    volatile    uint32_t    PDCRA;
    volatile    uint32_t    PUCRB;
    volatile    uint32_t    PDCRB;
    volatile    uint32_t    PUCRC;
    volatile    uint32_t    PDCRC;
    volatile    uint32_t    PUCRD;
    volatile    uint32_t    PDCRD;
    volatile    uint32_t    PUCRE;
    volatile    uint32_t    PDCRE;
    volatile    uint32_t    PUCRF;
    volatile    uint32_t    PDCRF;
    volatile    uint32_t    PUCRG;
    volatile    uint32_t    PDCRG;
    volatile    uint32_t    PUCRH;
    volatile    uint32_t    PDCRH;
    volatile    uint32_t    PUCRI;
    volatile    uint32_t    PDCRI;
    volatile    uint32_t    PUCRJ;
    volatile    uint32_t    PDCRJ;
    volatile    uint32_t    RESERVED0[2];
    volatile    uint32_t    CR4;
} PWR_TypeDef;

#ifdef __cplusplus
#define PWR_NS  reinterpret_cast<PWR_TypeDef *>(0x46020800u)
#define PWR_S   reinterpret_cast<PWR_TypeDef *>(0x56020800u)

#else
#define PWR_NS  ((PWR_TypeDef *)0x46020800u)
#define PWR_S   ((PWR_TypeDef *)0x56020800u)
#endif

// CR1 Configuration

#define PWR_CR1_SRAM5PD             (0x1u<<12)
#define PWR_CR1_SRAM4PD             (0x1u<<11)
#define PWR_CR1_SRAM3PD             (0x1u<<10)
#define PWR_CR1_SRAM2PD             (0x1u<<9)
#define PWR_CR1_SRAM1PD             (0x1u<<8)
#define PWR_CR1_ULPMEN              (0x1u<<7)
#define PWR_CR1_RRSB2               (0x1u<<6)
#define PWR_CR1_RRSB1               (0x1u<<5)
#define PWR_CR1_LPMS                (0x7u<<0)
#define PWR_CR1_LPMS_0              (0x1u<<0)
#define PWR_CR1_SRAM5PD_B_0X0       (0x0u<<12)
#define PWR_CR1_SRAM5PD_B_0X1       (0x1u<<12)
#define PWR_CR1_SRAM4PD_B_0X0       (0x0u<<11)
#define PWR_CR1_SRAM4PD_B_0X1       (0x1u<<11)
#define PWR_CR1_SRAM3PD_B_0X0       (0x0u<<10)
#define PWR_CR1_SRAM3PD_B_0X1       (0x1u<<10)
#define PWR_CR1_SRAM2PD_B_0X0       (0x0u<<9)
#define PWR_CR1_SRAM2PD_B_0X1       (0x1u<<9)
#define PWR_CR1_SRAM1PD_B_0X0       (0x0u<<8)
#define PWR_CR1_SRAM1PD_B_0X1       (0x1u<<8)
#define PWR_CR1_ULPMEN_B_0X0        (0x0u<<7)
#define PWR_CR1_ULPMEN_B_0X1        (0x1u<<7)
#define PWR_CR1_RRSB2_B_0X0         (0x0u<<6)
#define PWR_CR1_RRSB2_B_0X1         (0x1u<<6)
#define PWR_CR1_RRSB1_B_0X0         (0x0u<<5)
#define PWR_CR1_RRSB1_B_0X1         (0x1u<<5)
#define PWR_CR1_LPMS_B_0X0          (0x0u<<0)
#define PWR_CR1_LPMS_B_0X1          (0x1u<<0)
#define PWR_CR1_LPMS_B_0X2          (0x2u<<0)
#define PWR_CR1_LPMS_B_0X3          (0x3u<<0)

// CR2 Configuration

#define PWR_CR2_SRDRUN              (0x1u<<31)
#define PWR_CR2_DSIRAMPDS           (0x1u<<25)
#define PWR_CR2_GPRAMPDS            (0x1u<<24)
#define PWR_CR2_SRAM3PDS8           (0x1u<<23)
#define PWR_CR2_SRAM3PDS7           (0x1u<<22)
#define PWR_CR2_SRAM3PDS6           (0x1u<<21)
#define PWR_CR2_SRAM3PDS5           (0x1u<<20)
#define PWR_CR2_SRAM3PDS4           (0x1u<<19)
#define PWR_CR2_SRAM3PDS3           (0x1u<<18)
#define PWR_CR2_SRAM3PDS2           (0x1u<<17)
#define PWR_CR2_SRAM3PDS1           (0x1u<<16)
#define PWR_CR2_FLASHFWU            (0x1u<<14)
#define PWR_CR2_SRAM4FWU            (0x1u<<13)
#define PWR_CR2_PKARAMPDS           (0x1u<<12)
#define PWR_CR2_PRAMPDS             (0x1u<<11)
#define PWR_CR2_DMA2DRAMPDS         (0x1u<<10)
#define PWR_CR2_DC1RAMPDS           (0x1u<<9)
#define PWR_CR2_ICRAMPDS            (0x1u<<8)
#define PWR_CR2_DC2RAMPDS           (0x1u<<7)
#define PWR_CR2_SRAM4PDS            (0x1u<<6)
#define PWR_CR2_SRAM2PDS2           (0x1u<<5)
#define PWR_CR2_SRAM2PDS1           (0x1u<<4)
#define PWR_CR2_SRAM1PDS3           (0x1u<<2)
#define PWR_CR2_SRAM1PDS2           (0x1u<<1)
#define PWR_CR2_SRAM1PDS1           (0x1u<<0)
#define PWR_CR2_SRDRUN_B_0X0        (0x0u<<31)
#define PWR_CR2_SRDRUN_B_0X1        (0x1u<<31)
#define PWR_CR2_DSIRAMPDS_B_0X0     (0x0u<<25)
#define PWR_CR2_DSIRAMPDS_B_0X1     (0x1u<<25)
#define PWR_CR2_GPRAMPDS_B_0X0      (0x0u<<24)
#define PWR_CR2_GPRAMPDS_B_0X1      (0x1u<<24)
#define PWR_CR2_SRAM3PDS8_B_0X0     (0x0u<<23)
#define PWR_CR2_SRAM3PDS8_B_0X1     (0x1u<<23)
#define PWR_CR2_SRAM3PDS7_B_0X0     (0x0u<<22)
#define PWR_CR2_SRAM3PDS7_B_0X1     (0x1u<<22)
#define PWR_CR2_SRAM3PDS6_B_0X0     (0x0u<<21)
#define PWR_CR2_SRAM3PDS6_B_0X1     (0x1u<<21)
#define PWR_CR2_SRAM3PDS5_B_0X0     (0x0u<<20)
#define PWR_CR2_SRAM3PDS5_B_0X1     (0x1u<<20)
#define PWR_CR2_SRAM3PDS4_B_0X0     (0x0u<<19)
#define PWR_CR2_SRAM3PDS4_B_0X1     (0x1u<<19)
#define PWR_CR2_SRAM3PDS3_B_0X0     (0x0u<<18)
#define PWR_CR2_SRAM3PDS3_B_0X1     (0x1u<<18)
#define PWR_CR2_SRAM3PDS2_B_0X0     (0x0u<<17)
#define PWR_CR2_SRAM3PDS2_B_0X1     (0x1u<<17)
#define PWR_CR2_SRAM3PDS1_B_0X0     (0x0u<<16)
#define PWR_CR2_SRAM3PDS1_B_0X1     (0x1u<<16)
#define PWR_CR2_FLASHFWU_B_0X0      (0x0u<<14)
#define PWR_CR2_FLASHFWU_B_0X1      (0x1u<<14)
#define PWR_CR2_SRAM4FWU_B_0X0      (0x0u<<13)
#define PWR_CR2_SRAM4FWU_B_0X1      (0x1u<<13)
#define PWR_CR2_PKARAMPDS_B_0X0     (0x0u<<12)
#define PWR_CR2_PKARAMPDS_B_0X1     (0x1u<<12)
#define PWR_CR2_PRAMPDS_B_0X0       (0x0u<<11)
#define PWR_CR2_PRAMPDS_B_0X1       (0x1u<<11)
#define PWR_CR2_DMA2DRAMPDS_B_0X0   (0x0u<<10)
#define PWR_CR2_DMA2DRAMPDS_B_0X1   (0x1u<<10)
#define PWR_CR2_DC1RAMPDS_B_0X0     (0x0u<<9)
#define PWR_CR2_DC1RAMPDS_B_0X1     (0x1u<<9)
#define PWR_CR2_ICRAMPDS_B_0X0      (0x0u<<8)
#define PWR_CR2_ICRAMPDS_B_0X1      (0x1u<<8)
#define PWR_CR2_DC2RAMPDS_B_0X0     (0x0u<<7)
#define PWR_CR2_DC2RAMPDS_B_0X1     (0x1u<<7)
#define PWR_CR2_SRAM4PDS_B_0X0      (0x0u<<6)
#define PWR_CR2_SRAM4PDS_B_0X1      (0x1u<<6)
#define PWR_CR2_SRAM2PDS2_B_0X0     (0x0u<<5)
#define PWR_CR2_SRAM2PDS2_B_0X1     (0x1u<<5)
#define PWR_CR2_SRAM2PDS1_B_0X0     (0x0u<<4)
#define PWR_CR2_SRAM2PDS1_B_0X1     (0x1u<<4)
#define PWR_CR2_SRAM1PDS3_B_0X0     (0x0u<<2)
#define PWR_CR2_SRAM1PDS3_B_0X1     (0x1u<<2)
#define PWR_CR2_SRAM1PDS2_B_0X0     (0x0u<<1)
#define PWR_CR2_SRAM1PDS2_B_0X1     (0x1u<<1)
#define PWR_CR2_SRAM1PDS1_B_0X0     (0x0u<<0)
#define PWR_CR2_SRAM1PDS1_B_0X1     (0x1u<<0)

// CR3 Configuration

