Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_pwr.h
#define PWR_CR3_FSTEN               (0x1u<<2)
#define PWR_CR3_REGSEL              (0x1u<<1)
#define PWR_CR3_FSTEN_B_0X0         (0x0u<<2)
#define PWR_CR3_FSTEN_B_0X1         (0x1u<<2)
#define PWR_CR3_REGSEL_B_0X0        (0x0u<<1)
#define PWR_CR3_REGSEL_B_0X1        (0x1u<<1)

// VOSR Configuration

#define PWR_VOSR_USBBOOSTEN         (0x1u<<20)
#define PWR_VOSR_USBPWREN           (0x1u<<19)
#define PWR_VOSR_BOOSTEN            (0x1u<<18)
#define PWR_VOSR_VOS                (0x3u<<16)
#define PWR_VOSR_VOS_0              (0x1u<<16)
#define PWR_VOSR_VOSRDY             (0x1u<<15)
#define PWR_VOSR_BOOSTRDY           (0x1u<<14)
#define PWR_VOSR_USBBOOSTRDY        (0x1u<<13)
#define PWR_VOSR_USBBOOSTEN_B_0X0   (0x0u<<20)
#define PWR_VOSR_USBBOOSTEN_B_0X1   (0x1u<<20)
#define PWR_VOSR_USBPWREN_B_0X0     (0x0u<<19)
#define PWR_VOSR_USBPWREN_B_0X1     (0x1u<<19)
#define PWR_VOSR_BOOSTEN_B_0X0      (0x0u<<18)
#define PWR_VOSR_BOOSTEN_B_0X1      (0x1u<<18)
#define PWR_VOSR_VOS_B_0X0          (0x0u<<16)
#define PWR_VOSR_VOS_B_0X1          (0x1u<<16)
#define PWR_VOSR_VOS_B_0X2          (0x2u<<16)
#define PWR_VOSR_VOS_B_0X3          (0x3u<<16)
#define PWR_VOSR_VOSRDY_B_0X0       (0x0u<<15)
#define PWR_VOSR_VOSRDY_B_0X1       (0x1u<<15)
#define PWR_VOSR_BOOSTRDY_B_0X0     (0x0u<<14)
#define PWR_VOSR_BOOSTRDY_B_0X1     (0x1u<<14)
#define PWR_VOSR_USBBOOSTRDY_B_0X0  (0x0u<<13)
#define PWR_VOSR_USBBOOSTRDY_B_0X1  (0x1u<<13)

// SVMCR Configuration

#define PWR_SVMCR_ASV               (0x1u<<30)
#define PWR_SVMCR_IO2SV             (0x1u<<29)
#define PWR_SVMCR_USV               (0x1u<<28)
#define PWR_SVMCR_AVM2EN            (0x1u<<27)
#define PWR_SVMCR_AVM1EN            (0x1u<<26)
#define PWR_SVMCR_IO2VMEN           (0x1u<<25)
#define PWR_SVMCR_UVMEN             (0x1u<<24)
#define PWR_SVMCR_PVDLS             (0x7u<<5)
#define PWR_SVMCR_PVDLS_0           (0x1u<<5)
#define PWR_SVMCR_PVDE              (0x1u<<4)
#define PWR_SVMCR_ASV_B_0X0         (0x0u<<30)
#define PWR_SVMCR_ASV_B_0X1         (0x1u<<30)
#define PWR_SVMCR_IO2SV_B_0X0       (0x0u<<29)
#define PWR_SVMCR_IO2SV_B_0X1       (0x1u<<29)
#define PWR_SVMCR_USV_B_0X0         (0x0u<<28)
#define PWR_SVMCR_USV_B_0X1         (0x1u<<28)
#define PWR_SVMCR_AVM2EN_B_0X0      (0x0u<<27)
#define PWR_SVMCR_AVM2EN_B_0X1      (0x1u<<27)
#define PWR_SVMCR_AVM1EN_B_0X0      (0x0u<<26)
#define PWR_SVMCR_AVM1EN_B_0X1      (0x1u<<26)
#define PWR_SVMCR_IO2VMEN_B_0X0     (0x0u<<25)
#define PWR_SVMCR_IO2VMEN_B_0X1     (0x1u<<25)
#define PWR_SVMCR_UVMEN_B_0X0       (0x0u<<24)
#define PWR_SVMCR_UVMEN_B_0X1       (0x1u<<24)
#define PWR_SVMCR_PVDLS_B_0X0       (0x0u<<5)
#define PWR_SVMCR_PVDLS_B_0X1       (0x1u<<5)
#define PWR_SVMCR_PVDLS_B_0X2       (0x2u<<5)
#define PWR_SVMCR_PVDLS_B_0X3       (0x3u<<5)
#define PWR_SVMCR_PVDLS_B_0X4       (0x4u<<5)
#define PWR_SVMCR_PVDLS_B_0X5       (0x5u<<5)
#define PWR_SVMCR_PVDLS_B_0X6       (0x6u<<5)
#define PWR_SVMCR_PVDLS_B_0X7       (0x7u<<5)
#define PWR_SVMCR_PVDE_B_0X0        (0x0u<<4)
#define PWR_SVMCR_PVDE_B_0X1        (0x1u<<4)

// WUCR1 Configuration

#define PWR_WUCR1_WUPEN8            (0x1u<<7)
#define PWR_WUCR1_WUPEN7            (0x1u<<6)
#define PWR_WUCR1_WUPEN6            (0x1u<<5)
#define PWR_WUCR1_WUPEN5            (0x1u<<4)
#define PWR_WUCR1_WUPEN4            (0x1u<<3)
#define PWR_WUCR1_WUPEN3            (0x1u<<2)
#define PWR_WUCR1_WUPEN2            (0x1u<<1)
#define PWR_WUCR1_WUPEN1            (0x1u<<0)
#define PWR_WUCR1_WUPEN8_B_0X0      (0x0u<<7)
#define PWR_WUCR1_WUPEN8_B_0X1      (0x1u<<7)
#define PWR_WUCR1_WUPEN7_B_0X0      (0x0u<<6)
#define PWR_WUCR1_WUPEN7_B_0X1      (0x1u<<6)
#define PWR_WUCR1_WUPEN6_B_0X0      (0x0u<<5)
#define PWR_WUCR1_WUPEN6_B_0X1      (0x1u<<5)
#define PWR_WUCR1_WUPEN5_B_0X0      (0x0u<<4)
#define PWR_WUCR1_WUPEN5_B_0X1      (0x1u<<4)
#define PWR_WUCR1_WUPEN4_B_0X0      (0x0u<<3)
#define PWR_WUCR1_WUPEN4_B_0X1      (0x1u<<3)
#define PWR_WUCR1_WUPEN3_B_0X0      (0x0u<<2)
#define PWR_WUCR1_WUPEN3_B_0X1      (0x1u<<2)
#define PWR_WUCR1_WUPEN2_B_0X0      (0x0u<<1)
#define PWR_WUCR1_WUPEN2_B_0X1      (0x1u<<1)
#define PWR_WUCR1_WUPEN1_B_0X0      (0x0u<<0)
#define PWR_WUCR1_WUPEN1_B_0X1      (0x1u<<0)

// WUCR2 Configuration

#define PWR_WUCR2_WUPP8             (0x1u<<7)
#define PWR_WUCR2_WUPP7             (0x1u<<6)
#define PWR_WUCR2_WUPP6             (0x1u<<5)
#define PWR_WUCR2_WUPP5             (0x1u<<4)
#define PWR_WUCR2_WUPP4             (0x1u<<3)
#define PWR_WUCR2_WUPP3             (0x1u<<2)
#define PWR_WUCR2_WUPP2             (0x1u<<1)
#define PWR_WUCR2_WUPP1             (0x1u<<0)
#define PWR_WUCR2_WUPP8_B_0X0       (0x0u<<7)
#define PWR_WUCR2_WUPP8_B_0X1       (0x1u<<7)
#define PWR_WUCR2_WUPP7_B_0X0       (0x0u<<6)
#define PWR_WUCR2_WUPP7_B_0X1       (0x1u<<6)
#define PWR_WUCR2_WUPP6_B_0X0       (0x0u<<5)
#define PWR_WUCR2_WUPP6_B_0X1       (0x1u<<5)
#define PWR_WUCR2_WUPP5_B_0X0       (0x0u<<4)
#define PWR_WUCR2_WUPP5_B_0X1       (0x1u<<4)
#define PWR_WUCR2_WUPP4_B_0X0       (0x0u<<3)
#define PWR_WUCR2_WUPP4_B_0X1       (0x1u<<3)
#define PWR_WUCR2_WUPP3_B_0X0       (0x0u<<2)
#define PWR_WUCR2_WUPP3_B_0X1       (0x1u<<2)
#define PWR_WUCR2_WUPP2_B_0X0       (0x0u<<1)
#define PWR_WUCR2_WUPP2_B_0X1       (0x1u<<1)
#define PWR_WUCR2_WUPP1_B_0X0       (0x0u<<0)
#define PWR_WUCR2_WUPP1_B_0X1       (0x1u<<0)

// WUCR3 Configuration

#define PWR_WUCR3_WUSEL8            (0x3u<<14)
#define PWR_WUCR3_WUSEL8_0          (0x1u<<14)
#define PWR_WUCR3_WUSEL7            (0x3u<<12)
#define PWR_WUCR3_WUSEL7_0          (0x1u<<12)
#define PWR_WUCR3_WUSEL6            (0x3u<<10)
#define PWR_WUCR3_WUSEL6_0          (0x1u<<10)
#define PWR_WUCR3_WUSEL5            (0x3u<<8)
#define PWR_WUCR3_WUSEL5_0          (0x1u<<8)
#define PWR_WUCR3_WUSEL4            (0x3u<<6)
#define PWR_WUCR3_WUSEL4_0          (0x1u<<6)
#define PWR_WUCR3_WUSEL3            (0x3u<<4)
#define PWR_WUCR3_WUSEL3_0          (0x1u<<4)
#define PWR_WUCR3_WUSEL2            (0x3u<<2)
#define PWR_WUCR3_WUSEL2_0          (0x1u<<2)
#define PWR_WUCR3_WUSEL1            (0x3u<<0)
#define PWR_WUCR3_WUSEL1_0          (0x1u<<0)
#define PWR_WUCR3_WUSEL8_B_0X0      (0x0u<<14)
#define PWR_WUCR3_WUSEL8_B_0X1      (0x1u<<14)
#define PWR_WUCR3_WUSEL8_B_0X2      (0x2u<<14)
#define PWR_WUCR3_WUSEL8_B_0X3      (0x3u<<14)
#define PWR_WUCR3_WUSEL7_B_0X0      (0x0u<<12)
#define PWR_WUCR3_WUSEL7_B_0X1      (0x1u<<12)
#define PWR_WUCR3_WUSEL7_B_0X2      (0x2u<<12)
#define PWR_WUCR3_WUSEL7_B_0X3      (0x3u<<12)
#define PWR_WUCR3_WUSEL6_B_0X0      (0x0u<<10)
#define PWR_WUCR3_WUSEL6_B_0X1      (0x1u<<10)
#define PWR_WUCR3_WUSEL6_B_0X2      (0x2u<<10)
#define PWR_WUCR3_WUSEL6_B_0X3      (0x3u<<10)
#define PWR_WUCR3_WUSEL5_B_0X0      (0x0u<<8)
#define PWR_WUCR3_WUSEL5_B_0X1      (0x1u<<8)
#define PWR_WUCR3_WUSEL5_B_0X2      (0x2u<<8)
#define PWR_WUCR3_WUSEL5_B_0X3      (0x3u<<8)
#define PWR_WUCR3_WUSEL4_B_0X0      (0x0u<<6)
#define PWR_WUCR3_WUSEL4_B_0X1      (0x1u<<6)
#define PWR_WUCR3_WUSEL4_B_0X2      (0x2u<<6)
#define PWR_WUCR3_WUSEL4_B_0X3      (0x3u<<6)
#define PWR_WUCR3_WUSEL3_B_0X0      (0x0u<<4)
#define PWR_WUCR3_WUSEL3_B_0X1      (0x1u<<4)
#define PWR_WUCR3_WUSEL3_B_0X2      (0x2u<<4)
#define PWR_WUCR3_WUSEL3_B_0X3      (0x3u<<4)
#define PWR_WUCR3_WUSEL2_B_0X0      (0x0u<<2)
#define PWR_WUCR3_WUSEL2_B_0X1      (0x1u<<2)
#define PWR_WUCR3_WUSEL2_B_0X2      (0x2u<<2)
#define PWR_WUCR3_WUSEL2_B_0X3      (0x3u<<2)
#define PWR_WUCR3_WUSEL1_B_0X0      (0x0u<<0)
#define PWR_WUCR3_WUSEL1_B_0X1      (0x1u<<0)
#define PWR_WUCR3_WUSEL1_B_0X2      (0x2u<<0)
#define PWR_WUCR3_WUSEL1_B_0X3      (0x3u<<0)

// BDCR1 Configuration

#define PWR_BDCR1_MONEN             (0x1u<<4)
#define PWR_BDCR1_BREN              (0x1u<<0)
#define PWR_BDCR1_MONEN_B_0X0       (0x0u<<4)
#define PWR_BDCR1_MONEN_B_0X1       (0x1u<<4)
#define PWR_BDCR1_BREN_B_0X0        (0x0u<<0)
#define PWR_BDCR1_BREN_B_0X1        (0x1u<<0)

// BDCR2 Configuration

