Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_pwr.h
#define PWR_BDCR2_VBRS              (0x1u<<1)
#define PWR_BDCR2_VBE               (0x1u<<0)
#define PWR_BDCR2_VBRS_B_0X0        (0x0u<<1)
#define PWR_BDCR2_VBRS_B_0X1        (0x1u<<1)
#define PWR_BDCR2_VBE_B_0X0         (0x0u<<0)
#define PWR_BDCR2_VBE_B_0X1         (0x1u<<0)

// DBPR Configuration

#define PWR_DBPR_DBP                (0x1u<<0)
#define PWR_DBPR_DBP_B_0X0          (0x0u<<0)
#define PWR_DBPR_DBP_B_0X1          (0x1u<<0)

// UCPDR Configuration

#define PWR_UCPDR_UCPD_STBY         (0x1u<<1)
#define PWR_UCPDR_UCPD_DBDIS        (0x1u<<0)
#define PWR_UCPDR_UCPD_DBDIS_B_0X0  (0x0u<<0)
#define PWR_UCPDR_UCPD_DBDIS_B_0X1  (0x1u<<0)

// SECCFGR Configuration

#define PWR_SECCFGR_APCSEC          (0x1u<<15)
#define PWR_SECCFGR_VBSEC           (0x1u<<14)
#define PWR_SECCFGR_VDMSEC          (0x1u<<13)
#define PWR_SECCFGR_LPMSEC          (0x1u<<12)
#define PWR_SECCFGR_WUP8SEC         (0x1u<<7)
#define PWR_SECCFGR_WUP7SEC         (0x1u<<6)
#define PWR_SECCFGR_WUP6SEC         (0x1u<<5)
#define PWR_SECCFGR_WUP5SEC         (0x1u<<4)
#define PWR_SECCFGR_WUP4SEC         (0x1u<<3)
#define PWR_SECCFGR_WUP3SEC         (0x1u<<2)
#define PWR_SECCFGR_WUP2SEC         (0x1u<<1)
#define PWR_SECCFGR_WUP1SEC         (0x1u<<0)
#define PWR_SECCFGR_APCSEC_B_0X0    (0x0u<<15)
#define PWR_SECCFGR_APCSEC_B_0X1    (0x1u<<15)
#define PWR_SECCFGR_VBSEC_B_0X0     (0x0u<<14)
#define PWR_SECCFGR_VBSEC_B_0X1     (0x1u<<14)
#define PWR_SECCFGR_VDMSEC_B_0X0    (0x0u<<13)
#define PWR_SECCFGR_VDMSEC_B_0X1    (0x1u<<13)
#define PWR_SECCFGR_LPMSEC_B_0X0    (0x0u<<12)
#define PWR_SECCFGR_LPMSEC_B_0X1    (0x1u<<12)
#define PWR_SECCFGR_WUP8SEC_B_0X0   (0x0u<<7)
#define PWR_SECCFGR_WUP8SEC_B_0X1   (0x1u<<7)
#define PWR_SECCFGR_WUP7SEC_B_0X0   (0x0u<<6)
#define PWR_SECCFGR_WUP7SEC_B_0X1   (0x1u<<6)
#define PWR_SECCFGR_WUP6SEC_B_0X0   (0x0u<<5)
#define PWR_SECCFGR_WUP6SEC_B_0X1   (0x1u<<5)
#define PWR_SECCFGR_WUP5SEC_B_0X0   (0x0u<<4)
#define PWR_SECCFGR_WUP5SEC_B_0X1   (0x1u<<4)
#define PWR_SECCFGR_WUP4SEC_B_0X0   (0x0u<<3)
#define PWR_SECCFGR_WUP4SEC_B_0X1   (0x1u<<3)
#define PWR_SECCFGR_WUP3SEC_B_0X0   (0x0u<<2)
#define PWR_SECCFGR_WUP3SEC_B_0X1   (0x1u<<2)
#define PWR_SECCFGR_WUP2SEC_B_0X0   (0x0u<<1)
#define PWR_SECCFGR_WUP2SEC_B_0X1   (0x1u<<1)
#define PWR_SECCFGR_WUP1SEC_B_0X0   (0x0u<<0)
#define PWR_SECCFGR_WUP1SEC_B_0X1   (0x1u<<0)

// PRIVCFGR Configuration

#define PWR_PRIVCFGR_NSPRIV         (0x1u<<1)
#define PWR_PRIVCFGR_SPRIV          (0x1u<<0)
#define PWR_PRIVCFGR_NSPRIV_B_0X0   (0x0u<<1)
#define PWR_PRIVCFGR_NSPRIV_B_0X1   (0x1u<<1)
#define PWR_PRIVCFGR_SPRIV_B_0X0    (0x0u<<0)
#define PWR_PRIVCFGR_SPRIV_B_0X1    (0x1u<<0)

// SR Configuration

#define PWR_SR_SBF                  (0x1u<<2)
#define PWR_SR_STOPF                (0x1u<<1)
#define PWR_SR_CSSF                 (0x1u<<0)
#define PWR_SR_SBF_B_0X0            (0x0u<<2)
#define PWR_SR_SBF_B_0X1            (0x1u<<2)
#define PWR_SR_STOPF_B_0X0          (0x0u<<1)
#define PWR_SR_STOPF_B_0X1          (0x1u<<1)

// SVMSR Configuration

#define PWR_SVMSR_VDDA2RDY          (0x1u<<27)
#define PWR_SVMSR_VDDA1RDY          (0x1u<<26)
#define PWR_SVMSR_VDDIO2RDY         (0x1u<<25)
#define PWR_SVMSR_VDDUSBRDY         (0x1u<<24)
#define PWR_SVMSR_ACTVOS            (0x3u<<16)
#define PWR_SVMSR_ACTVOS_0          (0x1u<<16)
#define PWR_SVMSR_ACTVOSRDY         (0x1u<<15)
#define PWR_SVMSR_PVDO              (0x1u<<4)
#define PWR_SVMSR_REGS              (0x1u<<1)
#define PWR_SVMSR_VDDA2RDY_B_0X0    (0x0u<<27)
#define PWR_SVMSR_VDDA2RDY_B_0X1    (0x1u<<27)
#define PWR_SVMSR_VDDA1RDY_B_0X0    (0x0u<<26)
#define PWR_SVMSR_VDDA1RDY_B_0X1    (0x1u<<26)
#define PWR_SVMSR_VDDIO2RDY_B_0X0   (0x0u<<25)
#define PWR_SVMSR_VDDIO2RDY_B_0X1   (0x1u<<25)
#define PWR_SVMSR_VDDUSBRDY_B_0X0   (0x0u<<24)
#define PWR_SVMSR_VDDUSBRDY_B_0X1   (0x1u<<24)
#define PWR_SVMSR_ACTVOS_B_0X0      (0x0u<<16)
#define PWR_SVMSR_ACTVOS_B_0X1      (0x1u<<16)
#define PWR_SVMSR_ACTVOS_B_0X2      (0x2u<<16)
#define PWR_SVMSR_ACTVOS_B_0X3      (0x3u<<16)
#define PWR_SVMSR_ACTVOSRDY_B_0X0   (0x0u<<15)
#define PWR_SVMSR_ACTVOSRDY_B_0X1   (0x1u<<15)
#define PWR_SVMSR_PVDO_B_0X0        (0x0u<<4)
#define PWR_SVMSR_PVDO_B_0X1        (0x1u<<4)
#define PWR_SVMSR_REGS_B_0X0        (0x0u<<1)
#define PWR_SVMSR_REGS_B_0X1        (0x1u<<1)

// BDSR Configuration

#define PWR_BDSR_TEMPH              (0x1u<<3)
#define PWR_BDSR_TEMPL              (0x1u<<2)
#define PWR_BDSR_VBATH              (0x1u<<1)
#define PWR_BDSR_TEMPH_B_0X0        (0x0u<<3)
#define PWR_BDSR_TEMPH_B_0X1        (0x1u<<3)
#define PWR_BDSR_TEMPL_B_0X0        (0x0u<<2)
#define PWR_BDSR_TEMPL_B_0X1        (0x1u<<2)
#define PWR_BDSR_VBATH_B_0X0        (0x0u<<1)
#define PWR_BDSR_VBATH_B_0X1        (0x1u<<1)

// WUSR Configuration

#define PWR_WUSR_WUF8               (0x1u<<7)
#define PWR_WUSR_WUF7               (0x1u<<6)
#define PWR_WUSR_WUF6               (0x1u<<5)
#define PWR_WUSR_WUF5               (0x1u<<4)
#define PWR_WUSR_WUF4               (0x1u<<3)
#define PWR_WUSR_WUF3               (0x1u<<2)
#define PWR_WUSR_WUF2               (0x1u<<1)
#define PWR_WUSR_WUF1               (0x1u<<0)

// WUSCR Configuration

#define PWR_WUSCR_CWUF8             (0x1u<<7)
#define PWR_WUSCR_CWUF7             (0x1u<<6)
#define PWR_WUSCR_CWUF6             (0x1u<<5)
#define PWR_WUSCR_CWUF5             (0x1u<<4)
#define PWR_WUSCR_CWUF4             (0x1u<<3)
#define PWR_WUSCR_CWUF3             (0x1u<<2)
#define PWR_WUSCR_CWUF2             (0x1u<<1)
#define PWR_WUSCR_CWUF1             (0x1u<<0)

// APCR Configuration

#define PWR_APCR_APC                (0x1u<<0)

// PUCRA Configuration

#define PWR_PUCRA_PU15              (0x1u<<15)
#define PWR_PUCRA_PU13              (0x1u<<13)
#define PWR_PUCRA_PU12              (0x1u<<12)
#define PWR_PUCRA_PU11              (0x1u<<11)
#define PWR_PUCRA_PU10              (0x1u<<10)
#define PWR_PUCRA_PU9               (0x1u<<9)
#define PWR_PUCRA_PU8               (0x1u<<8)
#define PWR_PUCRA_PU7               (0x1u<<7)
#define PWR_PUCRA_PU6               (0x1u<<6)
#define PWR_PUCRA_PU5               (0x1u<<5)
#define PWR_PUCRA_PU4               (0x1u<<4)
#define PWR_PUCRA_PU3               (0x1u<<3)
#define PWR_PUCRA_PU2               (0x1u<<2)
#define PWR_PUCRA_PU1               (0x1u<<1)
#define PWR_PUCRA_PU0               (0x1u<<0)

