Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_pwr.h
// PDCRA Configuration

#define PWR_PDCRA_PD14              (0x1u<<14)
#define PWR_PDCRA_PD12              (0x1u<<12)
#define PWR_PDCRA_PD11              (0x1u<<11)
#define PWR_PDCRA_PD10              (0x1u<<10)
#define PWR_PDCRA_PD9               (0x1u<<9)
#define PWR_PDCRA_PD8               (0x1u<<8)
#define PWR_PDCRA_PD7               (0x1u<<7)
#define PWR_PDCRA_PD6               (0x1u<<6)
#define PWR_PDCRA_PD5               (0x1u<<5)
#define PWR_PDCRA_PD4               (0x1u<<4)
#define PWR_PDCRA_PD3               (0x1u<<3)
#define PWR_PDCRA_PD2               (0x1u<<2)
#define PWR_PDCRA_PD1               (0x1u<<1)
#define PWR_PDCRA_PD0               (0x1u<<0)

// PUCRB Configuration

#define PWR_PUCRB_PU15              (0x1u<<15)
#define PWR_PUCRB_PU14              (0x1u<<14)
#define PWR_PUCRB_PU13              (0x1u<<13)
#define PWR_PUCRB_PU12              (0x1u<<12)
#define PWR_PUCRB_PU11              (0x1u<<11)
#define PWR_PUCRB_PU10              (0x1u<<10)
#define PWR_PUCRB_PU9               (0x1u<<9)
#define PWR_PUCRB_PU8               (0x1u<<8)
#define PWR_PUCRB_PU7               (0x1u<<7)
#define PWR_PUCRB_PU6               (0x1u<<6)
#define PWR_PUCRB_PU5               (0x1u<<5)
#define PWR_PUCRB_PU4               (0x1u<<4)
#define PWR_PUCRB_PU3               (0x1u<<3)
#define PWR_PUCRB_PU2               (0x1u<<2)
#define PWR_PUCRB_PU1               (0x1u<<1)
#define PWR_PUCRB_PU0               (0x1u<<0)

// PDCRB Configuration

#define PWR_PDCRB_PD15              (0x1u<<15)
#define PWR_PDCRB_PD14              (0x1u<<14)
#define PWR_PDCRB_PD13              (0x1u<<13)
#define PWR_PDCRB_PD12              (0x1u<<12)
#define PWR_PDCRB_PD11              (0x1u<<11)
#define PWR_PDCRB_PD10              (0x1u<<10)
#define PWR_PDCRB_PD9               (0x1u<<9)
#define PWR_PDCRB_PD8               (0x1u<<8)
#define PWR_PDCRB_PD7               (0x1u<<7)
#define PWR_PDCRB_PD6               (0x1u<<6)
#define PWR_PDCRB_PD5               (0x1u<<5)
#define PWR_PDCRB_PD3               (0x1u<<3)
#define PWR_PDCRB_PD2               (0x1u<<2)
#define PWR_PDCRB_PD1               (0x1u<<1)
#define PWR_PDCRB_PD0               (0x1u<<0)

// PUCRC Configuration

#define PWR_PUCRC_PU15              (0x1u<<15)
#define PWR_PUCRC_PU14              (0x1u<<14)
#define PWR_PUCRC_PU13              (0x1u<<13)
#define PWR_PUCRC_PU12              (0x1u<<12)
#define PWR_PUCRC_PU11              (0x1u<<11)
#define PWR_PUCRC_PU10              (0x1u<<10)
#define PWR_PUCRC_PU9               (0x1u<<9)
#define PWR_PUCRC_PU8               (0x1u<<8)
#define PWR_PUCRC_PU7               (0x1u<<7)
#define PWR_PUCRC_PU6               (0x1u<<6)
#define PWR_PUCRC_PU5               (0x1u<<5)
#define PWR_PUCRC_PU4               (0x1u<<4)
#define PWR_PUCRC_PU3               (0x1u<<3)
#define PWR_PUCRC_PU2               (0x1u<<2)
#define PWR_PUCRC_PU1               (0x1u<<1)
#define PWR_PUCRC_PU0               (0x1u<<0)

// PDCRC Configuration

#define PWR_PDCRC_PD15              (0x1u<<15)
#define PWR_PDCRC_PD14              (0x1u<<14)
#define PWR_PDCRC_PD13              (0x1u<<13)
#define PWR_PDCRC_PD12              (0x1u<<12)
#define PWR_PDCRC_PD11              (0x1u<<11)
#define PWR_PDCRC_PD10              (0x1u<<10)
#define PWR_PDCRC_PD9               (0x1u<<9)
#define PWR_PDCRC_PD8               (0x1u<<8)
#define PWR_PDCRC_PD7               (0x1u<<7)
#define PWR_PDCRC_PD6               (0x1u<<6)
#define PWR_PDCRC_PD5               (0x1u<<5)
#define PWR_PDCRC_PD4               (0x1u<<4)
#define PWR_PDCRC_PD3               (0x1u<<3)
#define PWR_PDCRC_PD2               (0x1u<<2)
#define PWR_PDCRC_PD1               (0x1u<<1)
#define PWR_PDCRC_PD0               (0x1u<<0)

// PUCRD Configuration

#define PWR_PUCRD_PU15              (0x1u<<15)
#define PWR_PUCRD_PU14              (0x1u<<14)
#define PWR_PUCRD_PU13              (0x1u<<13)
#define PWR_PUCRD_PU12              (0x1u<<12)
#define PWR_PUCRD_PU11              (0x1u<<11)
#define PWR_PUCRD_PU10              (0x1u<<10)
#define PWR_PUCRD_PU9               (0x1u<<9)
#define PWR_PUCRD_PU8               (0x1u<<8)
#define PWR_PUCRD_PU7               (0x1u<<7)
#define PWR_PUCRD_PU6               (0x1u<<6)
#define PWR_PUCRD_PU5               (0x1u<<5)
#define PWR_PUCRD_PU4               (0x1u<<4)
#define PWR_PUCRD_PU3               (0x1u<<3)
#define PWR_PUCRD_PU2               (0x1u<<2)
#define PWR_PUCRD_PU1               (0x1u<<1)
#define PWR_PUCRD_PU0               (0x1u<<0)

// PDCRD Configuration

#define PWR_PDCRD_PD15              (0x1u<<15)
#define PWR_PDCRD_PD14              (0x1u<<14)
#define PWR_PDCRD_PD13              (0x1u<<13)
#define PWR_PDCRD_PD12              (0x1u<<12)
#define PWR_PDCRD_PD11              (0x1u<<11)
#define PWR_PDCRD_PD10              (0x1u<<10)
#define PWR_PDCRD_PD9               (0x1u<<9)
#define PWR_PDCRD_PD8               (0x1u<<8)
#define PWR_PDCRD_PD7               (0x1u<<7)
#define PWR_PDCRD_PD6               (0x1u<<6)
#define PWR_PDCRD_PD5               (0x1u<<5)
#define PWR_PDCRD_PD4               (0x1u<<4)
#define PWR_PDCRD_PD3               (0x1u<<3)
#define PWR_PDCRD_PD2               (0x1u<<2)
#define PWR_PDCRD_PD1               (0x1u<<1)
#define PWR_PDCRD_PD0               (0x1u<<0)

// PUCRE Configuration

#define PWR_PUCRE_PU15              (0x1u<<15)
#define PWR_PUCRE_PU14              (0x1u<<14)
#define PWR_PUCRE_PU13              (0x1u<<13)
#define PWR_PUCRE_PU12              (0x1u<<12)
#define PWR_PUCRE_PU11              (0x1u<<11)
#define PWR_PUCRE_PU10              (0x1u<<10)
#define PWR_PUCRE_PU9               (0x1u<<9)
#define PWR_PUCRE_PU8               (0x1u<<8)
#define PWR_PUCRE_PU7               (0x1u<<7)
#define PWR_PUCRE_PU6               (0x1u<<6)
#define PWR_PUCRE_PU5               (0x1u<<5)
#define PWR_PUCRE_PU4               (0x1u<<4)
#define PWR_PUCRE_PU3               (0x1u<<3)
#define PWR_PUCRE_PU2               (0x1u<<2)
#define PWR_PUCRE_PU1               (0x1u<<1)
#define PWR_PUCRE_PU0               (0x1u<<0)

// PDCRE Configuration

#define PWR_PDCRE_PD15              (0x1u<<15)
#define PWR_PDCRE_PD14              (0x1u<<14)
#define PWR_PDCRE_PD13              (0x1u<<13)
#define PWR_PDCRE_PD12              (0x1u<<12)
#define PWR_PDCRE_PD11              (0x1u<<11)
#define PWR_PDCRE_PD10              (0x1u<<10)
#define PWR_PDCRE_PD9               (0x1u<<9)
#define PWR_PDCRE_PD8               (0x1u<<8)
#define PWR_PDCRE_PD7               (0x1u<<7)
#define PWR_PDCRE_PD6               (0x1u<<6)
#define PWR_PDCRE_PD5               (0x1u<<5)
#define PWR_PDCRE_PD4               (0x1u<<4)
#define PWR_PDCRE_PD3               (0x1u<<3)
#define PWR_PDCRE_PD2               (0x1u<<2)
#define PWR_PDCRE_PD1               (0x1u<<1)
#define PWR_PDCRE_PD0               (0x1u<<0)

// PUCRF Configuration

#define PWR_PUCRF_PU15              (0x1u<<15)
#define PWR_PUCRF_PU14              (0x1u<<14)
#define PWR_PUCRF_PU13              (0x1u<<13)
#define PWR_PUCRF_PU12              (0x1u<<12)
#define PWR_PUCRF_PU11              (0x1u<<11)
#define PWR_PUCRF_PU10              (0x1u<<10)
#define PWR_PUCRF_PU9               (0x1u<<9)
#define PWR_PUCRF_PU8               (0x1u<<8)
#define PWR_PUCRF_PU7               (0x1u<<7)
#define PWR_PUCRF_PU6               (0x1u<<6)
#define PWR_PUCRF_PU5               (0x1u<<5)
#define PWR_PUCRF_PU4               (0x1u<<4)
#define PWR_PUCRF_PU3               (0x1u<<3)
#define PWR_PUCRF_PU2               (0x1u<<2)
#define PWR_PUCRF_PU1               (0x1u<<1)
#define PWR_PUCRF_PU0               (0x1u<<0)

// PDCRF Configuration

#define PWR_PDCRF_PD15              (0x1u<<15)
#define PWR_PDCRF_PD14              (0x1u<<14)
#define PWR_PDCRF_PD13              (0x1u<<13)
#define PWR_PDCRF_PD12              (0x1u<<12)
#define PWR_PDCRF_PD11              (0x1u<<11)
#define PWR_PDCRF_PD10              (0x1u<<10)
#define PWR_PDCRF_PD9               (0x1u<<9)
#define PWR_PDCRF_PD8               (0x1u<<8)
#define PWR_PDCRF_PD7               (0x1u<<7)
#define PWR_PDCRF_PD6               (0x1u<<6)
#define PWR_PDCRF_PD5               (0x1u<<5)
#define PWR_PDCRF_PD4               (0x1u<<4)
#define PWR_PDCRF_PD3               (0x1u<<3)
#define PWR_PDCRF_PD2               (0x1u<<2)
#define PWR_PDCRF_PD1               (0x1u<<1)
#define PWR_PDCRF_PD0               (0x1u<<0)

// PUCRG Configuration

#define PWR_PUCRG_PU15              (0x1u<<15)
#define PWR_PUCRG_PU14              (0x1u<<14)
#define PWR_PUCRG_PU13              (0x1u<<13)
#define PWR_PUCRG_PU12              (0x1u<<12)
#define PWR_PUCRG_PU11              (0x1u<<11)
#define PWR_PUCRG_PU10              (0x1u<<10)
#define PWR_PUCRG_PU9               (0x1u<<9)
#define PWR_PUCRG_PU8               (0x1u<<8)
#define PWR_PUCRG_PU7               (0x1u<<7)
#define PWR_PUCRG_PU6               (0x1u<<6)
#define PWR_PUCRG_PU5               (0x1u<<5)
#define PWR_PUCRG_PU4               (0x1u<<4)
#define PWR_PUCRG_PU3               (0x1u<<3)
#define PWR_PUCRG_PU2               (0x1u<<2)
#define PWR_PUCRG_PU1               (0x1u<<1)
#define PWR_PUCRG_PU0               (0x1u<<0)

// PDCRG Configuration

#define PWR_PDCRG_PD15              (0x1u<<15)
#define PWR_PDCRG_PD14              (0x1u<<14)
#define PWR_PDCRG_PD13              (0x1u<<13)
#define PWR_PDCRG_PD12              (0x1u<<12)
#define PWR_PDCRG_PD11              (0x1u<<11)
#define PWR_PDCRG_PD10              (0x1u<<10)
#define PWR_PDCRG_PD9               (0x1u<<9)
#define PWR_PDCRG_PD8               (0x1u<<8)
#define PWR_PDCRG_PD7               (0x1u<<7)
#define PWR_PDCRG_PD6               (0x1u<<6)
#define PWR_PDCRG_PD5               (0x1u<<5)
#define PWR_PDCRG_PD4               (0x1u<<4)
#define PWR_PDCRG_PD3               (0x1u<<3)
#define PWR_PDCRG_PD2               (0x1u<<2)
#define PWR_PDCRG_PD1               (0x1u<<1)
#define PWR_PDCRG_PD0               (0x1u<<0)

// PUCRH Configuration

#define PWR_PUCRH_PU15              (0x1u<<15)
#define PWR_PUCRH_PU14              (0x1u<<14)
#define PWR_PUCRH_PU13              (0x1u<<13)
#define PWR_PUCRH_PU12              (0x1u<<12)
#define PWR_PUCRH_PU11              (0x1u<<11)
#define PWR_PUCRH_PU10              (0x1u<<10)
#define PWR_PUCRH_PU9               (0x1u<<9)
#define PWR_PUCRH_PU8               (0x1u<<8)
#define PWR_PUCRH_PU7               (0x1u<<7)
#define PWR_PUCRH_PU6               (0x1u<<6)
#define PWR_PUCRH_PU5               (0x1u<<5)
#define PWR_PUCRH_PU4               (0x1u<<4)
#define PWR_PUCRH_PU3               (0x1u<<3)
#define PWR_PUCRH_PU2               (0x1u<<2)
#define PWR_PUCRH_PU1               (0x1u<<1)
#define PWR_PUCRH_PU0               (0x1u<<0)

// PDCRH Configuration

#define PWR_PDCRH_PD15              (0x1u<<15)
#define PWR_PDCRH_PD14              (0x1u<<14)
#define PWR_PDCRH_PD13              (0x1u<<13)
#define PWR_PDCRH_PD12              (0x1u<<12)
#define PWR_PDCRH_PD11              (0x1u<<11)
#define PWR_PDCRH_PD10              (0x1u<<10)
#define PWR_PDCRH_PD9               (0x1u<<9)
#define PWR_PDCRH_PD8               (0x1u<<8)
#define PWR_PDCRH_PD7               (0x1u<<7)
#define PWR_PDCRH_PD6               (0x1u<<6)
#define PWR_PDCRH_PD5               (0x1u<<5)
#define PWR_PDCRH_PD4               (0x1u<<4)
#define PWR_PDCRH_PD3               (0x1u<<3)
#define PWR_PDCRH_PD2               (0x1u<<2)
#define PWR_PDCRH_PD1               (0x1u<<1)
#define PWR_PDCRH_PD0               (0x1u<<0)

// PUCRI Configuration

#define PWR_PUCRI_PU15              (0x1u<<15)
#define PWR_PUCRI_PU14              (0x1u<<14)
#define PWR_PUCRI_PU13              (0x1u<<13)
#define PWR_PUCRI_PU12              (0x1u<<12)
#define PWR_PUCRI_PU11              (0x1u<<11)
#define PWR_PUCRI_PU10              (0x1u<<10)
#define PWR_PUCRI_PU9               (0x1u<<9)
#define PWR_PUCRI_PU8               (0x1u<<8)
#define PWR_PUCRI_PU7               (0x1u<<7)
#define PWR_PUCRI_PU6               (0x1u<<6)
#define PWR_PUCRI_PU5               (0x1u<<5)
#define PWR_PUCRI_PU4               (0x1u<<4)
#define PWR_PUCRI_PU3               (0x1u<<3)
#define PWR_PUCRI_PU2               (0x1u<<2)
#define PWR_PUCRI_PU1               (0x1u<<1)
#define PWR_PUCRI_PU0               (0x1u<<0)

// PDCRI Configuration

#define PWR_PDCRI_PD15              (0x1u<<15)
#define PWR_PDCRI_PD14              (0x1u<<14)
#define PWR_PDCRI_PD13              (0x1u<<13)
#define PWR_PDCRI_PD12              (0x1u<<12)
#define PWR_PDCRI_PD11              (0x1u<<11)
#define PWR_PDCRI_PD10              (0x1u<<10)
#define PWR_PDCRI_PD9               (0x1u<<9)
#define PWR_PDCRI_PD8               (0x1u<<8)
#define PWR_PDCRI_PD7               (0x1u<<7)
#define PWR_PDCRI_PD6               (0x1u<<6)
#define PWR_PDCRI_PD5               (0x1u<<5)
#define PWR_PDCRI_PD4               (0x1u<<4)
#define PWR_PDCRI_PD3               (0x1u<<3)
#define PWR_PDCRI_PD2               (0x1u<<2)
#define PWR_PDCRI_PD1               (0x1u<<1)
#define PWR_PDCRI_PD0               (0x1u<<0)

// PUCRJ Configuration

#define PWR_PUCRJ_PU11              (0x1u<<11)
#define PWR_PUCRJ_PU10              (0x1u<<10)
#define PWR_PUCRJ_PU9               (0x1u<<9)
#define PWR_PUCRJ_PU8               (0x1u<<8)
#define PWR_PUCRJ_PU7               (0x1u<<7)
#define PWR_PUCRJ_PU6               (0x1u<<6)
#define PWR_PUCRJ_PU5               (0x1u<<5)
#define PWR_PUCRJ_PU4               (0x1u<<4)
#define PWR_PUCRJ_PU3               (0x1u<<3)
#define PWR_PUCRJ_PU2               (0x1u<<2)
#define PWR_PUCRJ_PU1               (0x1u<<1)
#define PWR_PUCRJ_PU0               (0x1u<<0)

// PDCRJ Configuration

