Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_pwr.h
#define PWR_PDCRJ_PD11              (0x1u<<11)
#define PWR_PDCRJ_PD10              (0x1u<<10)
#define PWR_PDCRJ_PD9               (0x1u<<9)
#define PWR_PDCRJ_PD8               (0x1u<<8)
#define PWR_PDCRJ_PD7               (0x1u<<7)
#define PWR_PDCRJ_PD6               (0x1u<<6)
#define PWR_PDCRJ_PD5               (0x1u<<5)
#define PWR_PDCRJ_PD4               (0x1u<<4)
#define PWR_PDCRJ_PD3               (0x1u<<3)
#define PWR_PDCRJ_PD2               (0x1u<<2)
#define PWR_PDCRJ_PD1               (0x1u<<1)
#define PWR_PDCRJ_PD0               (0x1u<<0)

// CR4 Configuration

#define PWR_CR4_SRAM5PDS13          (0x1u<<28)
#define PWR_CR4_SRAM5PDS12          (0x1u<<27)
#define PWR_CR4_SRAM5PDS11          (0x1u<<26)
#define PWR_CR4_SRAM5PDS10          (0x1u<<25)
#define PWR_CR4_SRAM5PDS9           (0x1u<<24)
#define PWR_CR4_SRAM5PDS8           (0x1u<<23)
#define PWR_CR4_SRAM5PDS7           (0x1u<<22)
#define PWR_CR4_SRAM5PDS6           (0x1u<<21)
#define PWR_CR4_SRAM5PDS5           (0x1u<<20)
#define PWR_CR4_SRAM5PDS4           (0x1u<<19)
#define PWR_CR4_SRAM5PDS3           (0x1u<<18)
#define PWR_CR4_SRAM5PDS2           (0x1u<<17)
#define PWR_CR4_SRAM5PDS1           (0x1u<<16)
#define PWR_CR4_SRAM3PDS13          (0x1u<<14)
#define PWR_CR4_SRAM3PDS12          (0x1u<<13)
#define PWR_CR4_SRAM3PDS11          (0x1u<<12)
#define PWR_CR4_SRAM3PDS10          (0x1u<<11)
#define PWR_CR4_SRAM3PDS9           (0x1u<<10)
#define PWR_CR4_SRAM1PDS12          (0x1u<<8)
#define PWR_CR4_SRAM1PDS11          (0x1u<<7)
#define PWR_CR4_SRAM1PDS10          (0x1u<<6)
#define PWR_CR4_SRAM1PDS9           (0x1u<<5)
#define PWR_CR4_SRAM1PDS8           (0x1u<<4)
#define PWR_CR4_SRAM1PDS7           (0x1u<<3)
#define PWR_CR4_SRAM1PDS6           (0x1u<<2)
#define PWR_CR4_SRAM1PDS5           (0x1u<<1)
#define PWR_CR4_SRAM1PDS4           (0x1u<<0)
